## Taking in all the datasets and forming one data set with three columns

In [91]:
import numpy as np
import pandas as pd

In [92]:
df = pd.read_csv('Black-Female-Names.csv')

In [93]:
df.head()

  last name     first name gender   race
0   abraham   tashanika l       f  black
1     adams     denetra c       f  black
2     adams     tomesha d       f  black
3     adams    trellany c       f  black
4  adderley     cynthia s       f  black

In [94]:
df['name'] = df[' first name'].astype(str) + df['last name']

In [95]:
df.pop('last name')
df.pop(' first name')

0         tashanika l
1           denetra c
2           tomesha d
3          trellany c
4           cynthia s
5           crystal l
6           beverly s
7              robin
8            sophia l
9           marquita
10           sylvia h
11          dorothy k
12         zakiyyah n
13          crystal r
14         allissia p
15         mahogany t
16          melonise
17           monique
18          sherline
19         veronica j
20          beverly j
21           brenda j
22            delta s
23          genesha l
24         margaret a
25        stephanie s
26        pachadgin e
27           shaina a
28          latonia d
29           ashley a
             ...
2408          terrie w
2409     lamarsharee d
2410          jackie d
2411          latasha
2412      marquachun r
2413           tonya l
2414      alexandria a
2415          esther r
2416         lashonna
2417          latisha
2418          latonya
2419           margo a
2420          regina d
2421         shequena
2422         tawanda l
2423          tekelia
2424         tiffiny y
2425        charlene j
2426           denise
2427           kendra
2428           lillie
2429       frelandra s
2430          ashley a
2431        gwendolyn
2432        adrienne c
2433            marie
2434         laquinta
2435          felicia
2436          yolanda
2437         phillis a
Name:  first name, Length: 2438, dtype: object

In [96]:
df.shape

(2438, 3)

In [97]:
df2 = pd.read_csv('Black-Male-Names.csv')

In [98]:
df2.head()

  last name     first name gender   race
0     aaron       aaric a       m  black
1     aaron   dominique j       m  black
2     aaron    fredrick r       m  black
3     aaron       jarvis        m  black
4     aaron      lorenzo        m  black

In [99]:
df2['name'] = df2['first name'].astype(str) + df2['last name']

In [100]:
df2.head()

  last name     first name gender   race                name
0     aaron       aaric a       m  black       aaric a aaron
1     aaron   dominique j       m  black   dominique j aaron
2     aaron    fredrick r       m  black    fredrick r aaron
3     aaron       jarvis        m  black       jarvis  aaron
4     aaron      lorenzo        m  black      lorenzo  aaron

In [101]:
df2.pop('last name')
df2.pop('first name')

0               aaric a
1           dominique j
2            fredrick r
3               jarvis
4              lorenzo
5              paul r jr
6                 paul
7             richard s
8               tyler p
9          elsharnoubi
10             calvin j
11                ali s
12             lugman m
13              jihad a
14        hamid-ahmad i
15             saboor a
16              yusuf h
17             meshac m
18             gerald a
19              brian l
20               tony a
21            isiah j jr
22             johnny q
23             parish a
24              clyde d
25            derrick a
26             kahlil k
27             otha l jr
28               billy
29        christopher j
              ...
35051          andrew l
35052         anthony l
35053         anthony p
35054         anthony t
35055         antonio l
35056         antwann l
35057        benjamin a
35058         charlie e
35059            cody d
35060            corey
35061          curtis d
35062         darrell e
35063           darren
35064          darrin l
35065           david l
35066       dekevious l
35067           devin l
35068          donald c
35069        donald c jr
35070         douglas m
35071           ennis l
35072         enoch h jr
35073            eric s
35074          ernest a
35075         frankie l
35076         freddie l
35077        fredrick c
35078          gregory
35079           irvin c
35080          isaiah f
Name: first name, Length: 35081, dtype: object

In [102]:
df2.head()

  gender   race                name
0      m  black       aaric a aaron
1      m  black   dominique j aaron
2      m  black    fredrick r aaron
3      m  black       jarvis  aaron
4      m  black      lorenzo  aaron

In [103]:
df2.shape

(35081, 3)

In [104]:
df3 = pd.read_csv('Hispanic-Female-Names.csv')

In [105]:
df3.head()

  last name   first name gender      race
0     adams   shirley m       f  hispanic
1    alonso       ana d       f  hispanic
2    alonzo     miriam        f  hispanic
3   alvarez     ivette        f  hispanic
4    amador      saray        f  hispanic

In [106]:
df3['name'] = df3[' first name'].astype(str) + df3['last name']

In [107]:
df3.head()

  last name   first name gender      race              name
0     adams   shirley m       f  hispanic   shirley m adams
1    alonso       ana d       f  hispanic      ana d alonso
2    alonzo     miriam        f  hispanic    miriam  alonzo
3   alvarez     ivette        f  hispanic   ivette  alvarez
4    amador      saray        f  hispanic     saray  amador

In [108]:
df3.pop('last name')
df3.pop(' first name')

0         shirley m
1             ana d
2           miriam
3           ivette
4            saray
5           niurka
6            maria
7         merienne
8       rosalinda n
9         migdalia
10         marina v
11          carmen
12          zaida e
13         lurvin p
14         melissa
15        mileyka k
16       kimberly m
17        ivelisse
18            ana m
19         emilia l
20         connie d
21           anna v
22        samantha
23       elizabeth
24           ines g
25          djerid
26          ivette
27          gloria
28           linda
29          josefa
           ...
187          maria g
188      gabriella d
189        courtney
190        jasmine d
191        angelina
192           nina m
193          norma l
194        geraldil
195         gloria p
196         angela p
197          jazmin
198        eleazar p
199         takemi m
200          maria f
201          mirssa
202           vera m
203         delfida
204       christina
205         betrice
206           lisa m
207         denise t
208         cynthia
209          maria g
210          delia d
211         eulalia
212        monique m
213         lynette
214          maria s
215           dora m
216       manuella g
Name:  first name, Length: 217, dtype: object

In [109]:
df4 = pd.read_csv('Hispanic-Male-Names.csv')

In [110]:
df4.head()

       last name    first name gender      race
0           abad   jonathan r       m  hispanic
1  abellas-bauzo   jonathan a       m  hispanic
2          abreu       pablo        m  hispanic
3     abreu sosa    basilio l       m  hispanic
4   abreu-bolano      german        m  hispanic

In [111]:
df4['name'] = df4['first name'].astype(str) + df4['last name']

In [112]:
df4.head()

       last name    first name gender      race                       name
0           abad   jonathan r       m  hispanic            jonathan r abad
1  abellas-bauzo   jonathan a       m  hispanic   jonathan a abellas-bauzo
2          abreu       pablo        m  hispanic               pablo  abreu
3     abreu sosa    basilio l       m  hispanic       basilio l abreu sosa
4   abreu-bolano      german        m  hispanic       german  abreu-bolano

In [113]:
df4.pop('last name')
df4.pop('first name')

0           jonathan r
1           jonathan a
2               pablo
3            basilio l
4              german
5              javier
6               luis a
7               angel
8             antonio
9             brandy o
10            carlos r
11              diego
12             harold
13               jose
14            michael
15       christopher g
16             felipe
17           abraham r
18            alberto
19             brian n
20            carlos e
21         francisco s
22                joe
23              julio
24              luis a
25          moises b sr
26           orlando g
27             robert
28          wilfredo r
29              juan j
             ...
4136         apolinar p
4137            isidro
4138           abraham
4139            fredy a
4140           armando
4141              jose
4142             jamie
4143              juan
4144           santos r
4145            daniel
4146         francisco
4147            javier
4148             omar a
4149            romero
4150         lawrence g
4151           carlos u
4152            victor
4153           rodolfo
4154            diego h
4155            brian o
4156           johnny c
4157            efrain
4158          michael e
4159           joshua c
4160          michael b
4161           carlos a
4162             david
4163              joel
4164              luis
4165         rigoberto
Name: first name, Length: 4166, dtype: object

In [114]:
df5 = pd.read_csv('Indian-Female-Names.csv')

In [115]:
df5.head()

              name gender    race
0          shivani      f  indian
1             isha      f  indian
2  smt shyani devi      f  indian
3            divya      f  indian
4            mansi      f  indian

In [116]:
df5 = df5[['gender','race','name']]

In [117]:
df5.head()

  gender    race             name
0      f  indian          shivani
1      f  indian             isha
2      f  indian  smt shyani devi
3      f  indian            divya
4      f  indian            mansi

In [118]:
df6 = pd.read_csv('Indian-Male-Names.csv')

In [119]:
df6.head()

              name gender    race
0          barjraj      m  indian
1     ramdin verma      m  indian
2  sharat chandran      m  indian
3  birender mandal      m  indian
4             amit      m  indian

In [120]:
df6 = df6[['gender','race','name']]

In [121]:
df7 = pd.read_csv('White-Female-Names.csv')

In [122]:
df7.head()

   last name     first name gender   race
0     abbott      leslie b       f  white
1     abbott       peggy s       f  white
2  abernathy     rebecca r       f  white
3     abidin   antoinette        f  white
4       able    shaylene n       f  white

In [123]:
df7['name'] = df7[' first name'].astype(str) + df7['last name']

In [124]:
df7.head()

   last name     first name gender   race                  name
0     abbott      leslie b       f  white       leslie b abbott
1     abbott       peggy s       f  white        peggy s abbott
2  abernathy     rebecca r       f  white   rebecca r abernathy
3     abidin   antoinette        f  white    antoinette  abidin
4       able    shaylene n       f  white       shaylene n able

In [125]:
df7.pop('last name')
df7.pop(' first name')

0           leslie b
1            peggy s
2          rebecca r
3        antoinette
4         shaylene n
5          adneris e
6          melanie a
7           adriana
8           angela n
9         kathleen a
10        marjorie m
11         melissa m
12          nicole a
13         delemia s
14          andrea m
15          angela a
16         dannitta
17           haley e
18        jennifer l
19          lauryn a
20           nancy k
21          nicole m
22         patricia
23           ronda r
24        samantha e
25           sarah m
26           tonya e
27           tonya m
28          tracey j
29          ashley r
            ...
4570      patricia g
4571       freedom c
4572        holley a
4573      chassidy l
4574      virginia w
4575      patricia a
4576       melanie a
4577        denise m
4578        connie m
4579         kisha s
4580       melinda a
4581        melissa
4582         peggy s
4583        rachael
4584          tera l
4585           lisa
4586         angie m
4587       carleen v
4588        crystal
4589       darlene m
4590          kelly
4591       marlena c
4592       starlet r
4593      stefanie n
4594         vicki d
4595         andrea
4596      kimberly a
4597         amanda
4598        katrina
4599          lorri
Name:  first name, Length: 4600, dtype: object

In [126]:
df7.head()

  gender   race                  name
0      f  white       leslie b abbott
1      f  white        peggy s abbott
2      f  white   rebecca r abernathy
3      f  white    antoinette  abidin
4      f  white       shaylene n able

In [127]:
df8 = pd.read_csv('White-Male-Names.csv')

In [128]:
df8.head()

  last name    first name gender   race
0     aaron      billy r       m  white
1     aaron    charles d       m  white
2     aaron   clarence d       m  white
3     aaron     justin c       m  white
4     aaron        roy s       m  white

In [129]:
df8['name'] = df8[' first name'].astype(str) + df8['last name']

In [130]:
df8.head()

  last name    first name gender   race               name
0     aaron      billy r       m  white      billy r aaron
1     aaron    charles d       m  white    charles d aaron
2     aaron   clarence d       m  white   clarence d aaron
3     aaron     justin c       m  white     justin c aaron
4     aaron        roy s       m  white        roy s aaron

In [131]:
df8.pop(' first name')
df8.pop('last name')

0              aaron
1              aaron
2              aaron
3              aaron
4              aaron
5              aaron
6           aaronson
7              abate
8              abaza
9              abbas
10            abbate
11            abbate
12            abbate
13          abberger
14             abbey
15            abbott
16            abbott
17            abbott
18            abbott
19            abbott
20            abbott
21            abbott
22             abdal
23          abdallah
24            abdool
25              abel
26              abel
27              abel
28              abel
29       abercrombie
            ...
44018          young
44019          young
44020          young
44021          young
44022          young
44023          young
44024          young
44025          young
44026     youngblood
44027     youngblood
44028     youngblood
44029     youngblood
44030        younger
44031        youngii
44032        youngjr
44033          yount
44034      zacharysr
44035          zakis
44036     zakrzewski
44037        zastrow
44038           zelk
44039        zelnick
44040         zepeda
44041     ziegenfuss
44042      zimmerman
44043         zintel
44044         zipper
44045          zones
44046          zuber
44047       zwolanek
Name: last name, Length: 44048, dtype: object

In [132]:
df8.head()

  gender   race               name
0      m  white      billy r aaron
1      m  white    charles d aaron
2      m  white   clarence d aaron
3      m  white     justin c aaron
4      m  white        roy s aaron

In [137]:
print('df ',df.shape,'\ndf2',df2.shape,'\ndf3',df3.shape,'\ndf4',df4.shape,'\ndf5',df5.shape,'\ndf6',df6.shape,'\ndf7',df7.shape,'\ndf8',df8.shape )

df  (2438, 3)
df2 (35081, 3)
df3 (217, 3)
df4 (4166, 3)
df5 (15382, 3)
df6 (14845, 3)
df7 (4600, 3)
df8 (44048, 3)

In [138]:
frames = [df,df2,df3,df4,df5,df6,df7,df8]
final_df = pd.concat(frames)

In [140]:
df.to_csv('final_csv.csv')